import { Container, Row, Col } from "react-bootstrap";
import "./Consoles.css";
import Footer from "../../Components/Footer/Footer";
import { useSelector } from "react-redux";
import CCard from "./C_Card";
import psBaner from "../../assets/images/Console-Baner.jpeg";
import Meta from "../../Components/Helmet/Meta";

function Consoles() {
  const { ConsoleDatas } = useSelector((state) => state.Disk_Product);

  return (
    <>
      <Meta
        title="خرید کنسول‌های بازی PS5 و Xbox Series با گارانتی و ارسال سریع | GameSpot"
        description="فروش انواع کنسول بازی PS5، PS4، Xbox Series X|S با ضمانت اصل بودن، قیمت مناسب و ارسال سریع در فروشگاه GameSpot."
      />
      <Container className="Container-Disks-style p-3">
        <h1 style={{ fontSize: "30px", textAlign: "center", margin: "30px 0" }}>
          خرید انواع کنسول بازی{" "}
        </h1>
        <Row className="gy-5 row-cols-2 row-cols-md-2 row-cols-lg-3 row-cols-xl-5">
          {ConsoleDatas.length > 0 ? (
            ConsoleDatas.map((item) => (
              <Col key={item._id}>
                <CCard {...item} />
              </Col>
            ))
          ) : (
            <p>هیچ دیتایی برای نمایش وجود ندارد</p>
          )}
        </Row>
      </Container>
      <Container className=" mt-5 p-5 console-articels">
        <h3>خرید و قیمت PS5 | پی اس فایو</h3>
        <p>
          در این صفحه می‌توانید نسبت به خرید PS5 (پی اس فایو) اقدام کنید و قیمت
          PS5 در مدل‌های مختلف را مشاهده کنید. پلی استیشن 5 در دو مدل معمولی و
          پلی استیشن ۵ اسلیم عرضه شده‌اند که هر کدام از این مدل‌ها در دو نسخه
          استاندارد و دیجیتال به فروش می‌رسند.{" "}
        </p>
        <hr />
        <p>
          کنسول پلی استیشن ۵ که به‌اختصار پی اس فایو (PS5) نیز نامیده می‌شود،
          پرطرفدارترین کنسول بازی در ایران است. در ابتدا دو مدل سفید رنگ پلی
          استیشن ۵ استاندارد و پلی استیشن ۵ دیجیتال توسط سونی به بازار عرضه شد.
          در ادامه و طبق سنت همیشگی شرکت‌های عرضه کننده کنسول، نسخه جدید PS5 نیز
          وارد بازار شد.
        </p>
        <hr />
        <p>
          گرچه سونی نامی برای این کنسول کوچک‌تر و متفاوت‌تر انتخاب نکرد و آن را
          با همان نام قبلی پلی استیشن ۵ معرفی کرد، اما رسانه‌ها و مردم آن را با
          نام پلی استیشن ۵ اسلیم می‌شناسند. پلی استیشن ۵ اسلیم نیز با دو مدل
          استاندارد و پلی استیشن 5 دیجیتال به بازار عرضه شدند.
        </p>
        <hr />
        <h3>خصوصیات پلی استیشن 5 اسلیم</h3>
        <p>
          تفاوت بزرگ پلی استیشن ۵ اسلیم نسبت به نسخه معمولی، قابلیت نصب درایور
          نوری روی کنسول پلی استیشن ۵ دیجیتال است و این باعث می‌شود خریدارهای
          نسخه دیجیتال، هر زمان که احساس نیاز کردند، درایور نوری را اضافه کنند و
          صاحب یک پلی استیشن ۵ اسلیم دیسک خور شوند. دیگر تفاوت مهم پلی استیشن ۵
          اصلی با اسلیم، ظاهر، اندازه، وزن و ورودی آن‌هاست.
        </p>
        <p>
          ضمن اینکه کنسول پلی استیشن ۵ اسلیم، ورودی USB-C دارد و حافظه آن مقداری
          بیشتر از نسخه معمولی و به یک ترابایت رسیده است. مدتی بعدتر کنسول پلی
          استیشن 5 پرو نیز به بازار عرضه شد که علاوه بر ارتقای سخت افزاری، دو
          ترابایت حافظه داخلی دارد و فقط بصورت دیجیتال و با قیمت بالاتر وارد
          بازار شد.
        </p>
        <div
          style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            padding: "30px",
          }}
        >
          <img src={psBaner} alt="خرید ps5 نسخه محدود اسپایدر من  باندل اسپایدرمن" />
        </div>
        <h3>گارانتی پلی استیشن ۵</h3>
        <p>
          هر وسیله الکترونیکی امکان خرابی در قسمت‌های مختلف دارد. با توجه به
          مشکلات حمل و نقل و نوسان برق در مناطق مختلف، امکان آسیب به کنسول وجود
          دارد. شما می‌توانید در هنگام خرید پلی استیشن ۵، کنسول را با پرداخت
          هزینه اضافه و گزینه‌های موجود گارانتی کنید. گارانتی پلی استیشن ۵ علاوه
          بر ۱۰ روز ضمانت رایگان برای تعویض، شامل گارانتی خدمات و تعویض می‌شود.
          در صورت انتخاب گارانتی خدمات، کنسول به‌صورت رایگان برای شما تعمیر
          می‌شود و در صورت انتخاب گارانتی تعویض، کنسول شما با یک پلی استیشن ۵ نو
          تعویض می‌شود. برای اطمینان بیشتر و استفاده با خیال آسوده، پیشنهاد
          می‌کنیم کنسول خود را گارانتی کنید.
        </p>
      </Container>
      <Footer />
    </>
  );
}

export default Consoles;
